app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('9da940a4255b0ebb4bc7cfa04ba1a4f202deb949', '2010-02-03 20:00:17', '6629b276f7586dbad3543de022db7f10ed3443bb', NULL, NULL, 'admin', 'shannon@shannonmrush.com', '2010-02-03 20:00:17')
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!