app/controllers/admin_controller.rb

  def upload_photos
    number = Shoot.get_number(params[:photo][:shoot_id])
    params[:uploaded_data].each do |p|
      photo = Photo.new(params[:photo])
      photo.number = number
      photo.uploaded_data = p
      photo.save
---
INSERT INTO `photos` (`content_type`, `updated_at`, `size`, `number`, `filename`, `height`, `shoot_id`, `file`, `created_at`, `width`) VALUES('image/jpeg', '2010-02-01 17:09:54', 223578, NULL, 'colospgs0001.JPG', 750, NULL, NULL, '2010-02-01 17:09:54', 500)

  def create_gallery
    Gallery.create(params[:gallery])
---
INSERT INTO `galleries` (`name`, `updated_at`, `password`, `created_at`) VALUES(NULL, '2010-02-01 18:03:56', NULL, '2010-02-01 18:03:56')

  def create_shoot
    Shoot.create(params[:shoot])
---
INSERT INTO `shoots` (`name`, `gallery_id`, `updated_at`, `date`, `created_at`) VALUES('Colorado Springs', 6, '2010-02-01 18:35:53', '2009-09-01 00:00:00', '2010-02-01 18:35:53')