app/controllers/galleries_controller.rb

  def show
    @gallery = Gallery.find(params[:id])
    @shoot = params[:shoot_id].blank? ? @gallery.shoots.first : Shoot.find(params[:shoot_id])
    @photo = params[:photo_id].blank? ? @shoot.photos.first : Photo.find(params[:photo_id])
---
SELECT * FROM `galleries` WHERE (`galleries`.`id` = 6)
SELECT * FROM `shoots` WHERE (`shoots`.gallery_id = 6) ORDER BY date DESC LIMIT 1
SELECT * FROM `photos` WHERE (`photos`.shoot_id = 1) ORDER BY number DESC LIMIT 1